In [1]:
import numpy as np
import pandas as pd

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
train_data = pd.read_csv("Predicting-House-Prices-In-Bengaluru-Train-Data.csv")

In [4]:
train_data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
area_type       13320 non-null object
availability    13320 non-null object
location        13319 non-null object
size            13304 non-null object
society         7818 non-null object
total_sqft      13320 non-null object
bath            13247 non-null float64
balcony         12711 non-null float64
price           13320 non-null float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
train_data.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
train_data["size"].fillna(train_data["size"].value_counts().index[0], inplace=True)
train_data["location"].fillna(train_data["location"].value_counts().index[0], inplace=True)

In [8]:
def fun1(params):
    p = params[0]
    bs = int(p.split(" ")[0])
    return bs

In [9]:
train_data["size"] = train_data[["size"]].apply(lambda x: fun1(x), axis=1)

In [10]:
train_data["bath"].fillna(train_data["bath"].mean(), inplace=True)
train_data["balcony"].fillna(train_data["balcony"].mean(), inplace=True)

train_data["bath"] = train_data["bath"].astype('int8')
train_data["balcony"] = train_data["balcony"].astype('int8')

train_data.drop("society", axis=1, inplace=True)

In [11]:
def fun2(params):
    av = params[0]
    if(av == "Ready To Move"):
        val = 0
    elif(av == "Immediate Possession"):
        val = 1
    else:
        val = 2
    return val

In [12]:
train_data["availability"] = train_data[["availability"]].apply(lambda x: fun2(x), axis=1)

train_data['total_sqft'] = pd.to_numeric(train_data['total_sqft'], errors='coerce')
train_data['total_sqft'].fillna(train_data['total_sqft'].mean(), inplace=True)

In [13]:
train_data.tail()

,area_type,availability,location,size,total_sqft,bath,balcony,price
13315,Built-up Area,0,Whitefield,5,3453.0,4,0,231.0
13316,Super built-up Area,0,Richards Town,4,3600.0,5,1,400.0
13317,Built-up Area,0,Raja Rajeshwari Nagar,2,1141.0,2,1,60.0
13318,Super built-up Area,2,Padmanabhanagar,4,4689.0,4,1,488.0
13319,Super built-up Area,0,Doddathoguru,1,550.0,1,1,17.0

In [14]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 8 columns):
area_type       13320 non-null object
availability    13320 non-null int64
location        13320 non-null object
size            13320 non-null int64
total_sqft      13320 non-null float64
bath            13320 non-null int8
balcony         13320 non-null int8
price           13320 non-null float64
dtypes: float64(2), int64(2), int8(2), object(2)
memory usage: 650.5+ KB

In [15]:
for col in train_data.columns:
    if train_data[col].dtype == "object":
        train_data[col] = pd.Categorical(train_data[col]).codes

In [16]:
train_data.head()

   area_type  availability  location  size  total_sqft  bath  balcony   price
0          3             2       419     2      1056.0     2        1   39.07
1          2             0       317     4      2600.0     5        3  120.00
2          0             0      1179     3      1440.0     2        3   62.00
3          3             0       757     3      1521.0     3        1   95.00
4          3             0       716     2      1200.0     2        1   51.00

In [17]:
X = train_data.drop(["price"], axis=1)
y = train_data["price"]

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.3, random_state=33)

In [20]:
X_train.shape
X_val.shape
y_train.shape
y_val.shape

(9324, 7)

(3996, 7)

(9324,)

(3996,)

In [21]:
test_data = pd.read_csv("Predicting-House-Prices-In-Bengaluru-Test-Data.csv")

In [22]:
test_data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,Ready To Move,Brookefield,2 BHK,Roeekbl,1225,2.0,2.0,NaN
1,Plot Area,Ready To Move,Akshaya Nagar,9 Bedroom,NaN,2400,9.0,2.0,NaN
2,Plot Area,18-Apr,Hennur Road,4 Bedroom,Saandtt,1650,5.0,2.0,NaN
3,Super built-up Area,Ready To Move,Kodichikkanahalli,3 BHK,Winerri,1322,3.0,1.0,NaN
4,Super built-up Area,Ready To Move,Konanakunte,2 BHK,AmageSa,1161,2.0,1.0,NaN

In [23]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1480 entries, 0 to 1479
Data columns (total 9 columns):
area_type       1480 non-null object
availability    1480 non-null object
location        1480 non-null object
size            1478 non-null object
society         854 non-null object
total_sqft      1480 non-null object
bath            1473 non-null float64
balcony         1411 non-null float64
price           0 non-null float64
dtypes: float64(3), object(6)
memory usage: 104.2+ KB

In [24]:
test_data.isnull().sum()

area_type          0
availability       0
location           0
size               2
society          626
total_sqft         0
bath               7
balcony           69
price           1480
dtype: int64

In [25]:
test_data["size"].fillna(test_data["size"].value_counts().index[0], inplace=True)
test_data["location"].fillna(test_data["location"].value_counts().index[0], inplace=True)

In [26]:
test_data["size"] = test_data[["size"]].apply(lambda x: fun1(x), axis=1)

In [27]:
test_data["bath"].fillna(test_data["bath"].mean(), inplace=True)
test_data["balcony"].fillna(test_data["balcony"].mean(), inplace=True)

test_data["bath"] = test_data["bath"].astype('int8')
test_data["balcony"] = test_data["balcony"].astype('int8')

test_data.drop("society", axis=1, inplace=True)

test_data["availability"] = test_data[["availability"]].apply(lambda x: fun2(x), axis=1)

In [28]:
test_data['total_sqft'] = pd.to_numeric(test_data['total_sqft'], errors='coerce')
test_data['total_sqft'].fillna(test_data['total_sqft'].mean(), inplace=True)

In [29]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1480 entries, 0 to 1479
Data columns (total 8 columns):
area_type       1480 non-null object
availability    1480 non-null int64
location        1480 non-null object
size            1480 non-null int64
total_sqft      1480 non-null float64
bath            1480 non-null int8
balcony         1480 non-null int8
price           0 non-null float64
dtypes: float64(2), int64(2), int8(2), object(2)
memory usage: 72.4+ KB

In [30]:
for col in test_data.columns:
    if test_data[col].dtype == "object":
        test_data[col] = pd.Categorical(test_data[col]).codes

In [31]:
test_data["price"].fillna(0, inplace=True)

In [32]:
test_data.isnull().sum()

area_type       0
availability    0
location        0
size            0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [33]:
test_data.sample(10)

,area_type,availability,location,size,total_sqft,bath,balcony,price
786,3,2,203,3,1920.0,3,2,0.0
924,3,0,376,2,1143.0,2,2,0.0
1115,2,0,12,5,1200.0,4,2,0.0
1284,3,0,197,4,2870.0,4,2,0.0
1358,3,0,432,3,1525.0,3,2,0.0
1120,3,0,282,2,1000.0,2,2,0.0
729,3,0,379,4,3436.0,5,3,0.0
40,2,0,190,5,1200.0,4,1,0.0
340,3,0,106,2,864.0,2,1,0.0
761,2,2,476,3,1200.0,3,1,0.0

In [34]:
X_test = test_data.drop(["price"], axis=1)
y_test = test_data["price"]

In [35]:
from sklearn.linear_model import LinearRegression

In [36]:
linreg = LinearRegression()

In [37]:
model = linreg.fit(X_train, y_train)
predict = model.predict(X_test)
print(predict)

[ 74.39164179 345.45087981 190.20418725 ...  73.84992519  64.11918071
  72.72183444]

In [38]:
predict.shape

(1480,)

In [39]:
df = pd.DataFrame({"price" : predict})

In [40]:
writer = pd.ExcelWriter("House Prices Prediction in Bangalore.xlsx")
df.to_excel(writer, "Bangalore House Price", index=False)
writer.save()

In [41]:
print(linreg.coef_)

[-7.49536931e-01 -1.88861817e+00 -3.42463722e-03 -7.76734849e+00
  5.56245507e-02  3.70142417e+01 -5.20308352e+00]

In [42]:
from sklearn import metrics

In [43]:
print('MAE ====>>>>', metrics.mean_absolute_error(y_test, predict))
print('MSE ====>>>>', metrics.mean_squared_error(y_test, predict))
print('RMSE ====>>>>', np.sqrt(metrics.mean_squared_error(y_test, predict)))
print("RMSLE ====>>>>",  np.sqrt(metrics.mean_squared_log_error(y_test, predict)))

MAE ====>>>> 114.70367180312543
MSE ====>>>> 18657.133275773638
RMSE ====>>>> 136.59111711884356
RMSLE ====>>>> 4.6148613389770645